In [2]:
import pandas as pd

data = {
    'city' : ['서울','경기도','제주','부산'],
    'total1' : [1258358,35162,26272,3416],
    'total2' : [12600,35100,26200,77006]
    
}
data_frame = pd.DataFrame(data)
data_frame

  city   total1  total2
0   서울  1258358   12600
1  경기도    35162   35100
2   제주    26272   26200
3   부산     3416   77006

In [3]:
data_frame.dtypes

city      object
total1     int64
total2     int64
dtype: object

# dtype 변경

## apply 함수
- 문법 데이터프레임['컬럼명'].apply(파이썬 기본자료형)
- 대입해야지만 저장가능해요

In [6]:
## total1 -> object 변경
data_frame.total1.apply(str)

0    1258358
1      35162
2      26272
3       3416
Name: total1, dtype: object

In [7]:
## total1 -> object 변경
data_frame.total1.apply(str)[0]

'1258358'

In [9]:
data_frame.total1 = data_frame.total1.apply(str)
data_frame.dtypes

city      object
total1    object
total2     int64
dtype: object

### 여러 컬럼

In [38]:
## total1, total2 를 flaot
#apply는 자료형이 하나만 변경되용
#apply(pd.to_numeric)는 자기 생각한 대로 자료 변경
data_frame[['total1','total2']].apply(pd.to_numeric)

    total1  total2
0  1258358   12600
1    35162   35100
2    26272   26200
3     3416   77006

## astype 함수
- 변경이 자유롭고 자주 쓰는 함수쓰
- 문법 
    - 시리즈.astype('type')
    - dataFrame.astype({컬럼명:'type', 여러게})

In [42]:
data_frame.dtypes

city      object
total1    object
total2     int64
dtype: object

In [50]:
pd.Series([1,3,6]).astype('float16')

0    1.0
1    3.0
2    6.0
dtype: float16

In [43]:
data_frame.total1.astype(float)

0    1258358.0
1      35162.0
2      26272.0
3       3416.0
Name: total1, dtype: float64

In [49]:
#infinite 
data_frame.total1.astype('float16')

C:\Users\hi-sinchon\anaconda3\envs\ex\lib\site-packages\pandas\core\dtypes\astype.py:138: RuntimeWarning: overflow encountered in cast
  return arr.astype(dtype, copy=True)

0        inf
1    35168.0
2    26272.0
3     3416.0
Name: total1, dtype: float16

In [44]:
data_frame.total1.astype('float32')

0    1258358.0
1      35162.0
2      26272.0
3       3416.0
Name: total1, dtype: float32

In [45]:
data_frame.total1.astype('float64')

0    1258358.0
1      35162.0
2      26272.0
3       3416.0
Name: total1, dtype: float64

In [51]:
data_frame.total1.astype(int)

0    1258358
1      35162
2      26272
3       3416
Name: total1, dtype: int32

In [58]:
data_frame.total1.astype('int64')

0    1258358
1      35162
2      26272
3       3416
Name: total1, dtype: int64

# **데이터 값은 값에 맞춰서 만들어요

In [60]:
data_frame.dtypes

city      object
total1    object
total2     int64
dtype: object

In [62]:
data_frame.astype({'total1':'float','total2':float}).dtypes

city       object
total1    float64
total2    float64
dtype: object

In [63]:
data_frame.astype({'total1':'float32','total2':str}).dtypes

city       object
total1    float32
total2     object
dtype: object

In [64]:
#경기의 total1 값을 없음 변경
data_frame

  city   total1  total2
0   서울  1258358   12600
1  경기도    35162   35100
2   제주    26272   26200
3   부산     3416   77006

In [75]:
data_frame.loc[1,'total1'] = '없음'
data_frame.total1.dtype

dtype('O')

## 실제 값중에서 문자열이 불규칙하게 있을 때 결측치으로 보여지게 되용

In [82]:
data_frame.total1.apply(pd.to_numeric, errors='coerce')

0    1258358.0
1          NaN
2      26272.0
3       3416.0
Name: total1, dtype: float64

In [78]:
help(data_frame.apply)

Help on method apply in module pandas.core.frame:

apply(func: 'AggFuncType', axis: 'Axis' = 0, raw: 'bool' = False, result_type: "Literal[('expand', 'reduce', 'broadcast')] | None" = None, args=(), **kwargs) method of pandas.core.frame.DataFrame instance
    Apply a function along an axis of the DataFrame.

    Objects passed to the function are Series objects whose index is
    either the DataFrame's index (``axis=0``) or the DataFrame's columns
    (``axis=1``). By default (``result_type=None``), the final return type
    is inferred from the return type of the applied function. Otherwise,
    it depends on the `result_type` argument.

    Parameters
    ----------
    func : function
        Function to apply to each column or row.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis along which the function is applied:

        * 0 or 'index': apply function to each column.
        * 1 or 'columns': apply function to each row.

    raw : bool, default False
        Determines if row or column is passed as a Series or ndarray object:

        * ``False`` : passes each row or column as a Series to the
          function.
        * ``True`` : the passed function will receive ndarray objects
          instead.
          If you are just applying a NumPy reduction function this will
          achieve much better performance.

    result_type : {'expand', 'reduce', 'broadcast', None}, default None
        These only act when ``axis=1`` (columns):

        * 'expand' : list-like results will be turned into columns.
        * 'reduce' : returns a Series if possible rather than expanding
          list-like results. This is the opposite of 'expand'.
        * 'broadcast' : results will be broadcast to the original shape
          of the DataFrame, the original index and columns will be
          retained.

        The default behaviour (None) depends on the return value of the
        applied function: list-like results will be returned as a Series
        of those. However if the apply function returns a Series these
        are expanded to columns.
    args : tuple
        Positional arguments to pass to `func` in addition to the
        array/series.
    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

    Returns
    -------
    Series or DataFrame
        Result of applying ``func`` along the given axis of the
        DataFrame.

    See Also
    --------
    DataFrame.applymap: For elementwise operations.
    DataFrame.aggregate: Only perform aggregating type operations.
    DataFrame.transform: Only perform transforming type operations.

    Notes
    -----
    Functions that mutate the passed object can produce unexpected
    behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
    for more details.

    Examples
    --------
    >>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
    >>> df
       A  B
    0  4  9
    1  4  9
    2  4  9

    Using a numpy universal function (in this case the same as
    ``np.sqrt(df)``):

    >>> df.apply(np.sqrt)
         A    B
    0  2.0  3.0
    1  2.0  3.0
    2  2.0  3.0

    Using a reducing function on either axis

    >>> df.apply(np.sum, axis=0)
    A    12
    B    27
    dtype: int64

    >>> df.apply(np.sum, axis=1)
    0    13
    1    13
    2    13
    dtype: int64

    Returning a list-like will result in a Series

    >>> df.apply(lambda x: [1, 2], axis=1)
    0    [1, 2]
    1    [1, 2]
    2    [1, 2]
    dtype: object

    Passing ``result_type='expand'`` will expand list-like results
    to columns of a Dataframe

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
       0  1
    0  1  2
    1  1  2
    2  1  2

    Returning a Series inside the function is similar to passing
    ``result_type='expand'``. The resulting column names
    will be the Series index.

    >>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
       foo  bar
    0    1    2
    1    1    2
    2    1    2

    Passing ``result_type='broadcast'`` will ensure the same shape
    result, whether list-like or scalar is returned by the function,
    and broadcast it along the axis. The resulting column names will
    be the originals.

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
       A  B
    0  1  2
    1  1  2
    2  1  2